const station_data = 'district_id,longitude,latitude,name_Chinese,name_Pinyin\n' +
    '00101,116.173553,40.09068,海淀北部新区,Haidianbeibuxinqu\n' +
    '00102,116.184239,39.91441,石景山古城,Shijingshangucheng\n' +
    '00103,116.17115,39.815129,丰台云岗,Fengtaiyungang\n' +
    '00104,116.136045,39.742768,房山良乡,Fangshanliangxiang\n' +
    '00101,116.287451,39.987314000000005,海淀万柳,Haidianwanliu\n' +
    '00105,116.3974,39.982053,朝阳奥体中心,Zhaoyangaotizhongxin\n' +
    '00101,116.348991,39.954047,西直门北大街,Xizhimenbeidajie\n' +
    '00106,116.351974,39.878193,西城万寿西宫,Xichengwanshouxigong\n' +
    '00103,116.39401,39.876184,永定门内大街,Yongdingmenneidajie\n' +
    '00105,116.460743,39.937119,朝阳农展馆,Zhaoyangnongzhanguan\n' +
    '00107,116.416883,39.929287,东城东四,Dongchengdongsi\n' +
    '00106,116.35103,39.929303,西城官园,Xichengguanyuan\n' +
    '00103,116.279082,39.86347,丰台花园,Fengtaihuayuan\n' +
    '00108,116.406155,39.718147,大兴黄村镇,Daxinghuangcunzhen\n' +
    '00108,116.506319,39.794491,亦庄开发区,Yizhuangkaifaqu\n' +
    '00107,116.407356,39.886492,东城天坛,Dongchengtiantan\n' +
    '00107,116.395383,39.899136,前门东大街,Qianmendongdajie\n' +
    '00110,116.655,40.127,顺义新城,Shunyixincheng\n' +
    '00111,116.23,40.217,昌平镇,Changpingzhen\n' +
    '00112,116.106,39.937,门头沟龙泉镇,Mentougoulongquanzhen\n' +
    '00113,117.1,40.143,平谷镇,Pingguzhen\n' +
    '00114,116.628,40.328,怀柔镇,Huairouzhen\n' +
    '00115,116.832,40.37,密云镇,Miyunzhen\n' +
    '00116,115.972,40.453,延庆镇,Yanqingzhen\n' +
    '00111,116.22,40.292,昌平定陵,Changpingdingling\n' +
    '00115,116.911,40.499,京东北密云水库,Jingdongbeimiyunshuiku\n' +
    '00113,117.12,40.1,京东东高村,Jingdongdonggaocun\n' +
    '00109,116.783,39.712,京东南永乐店,Jingdongnanyongledian\n' +
    '00108,116.3,39.52,京南榆垡,Jingnanyufa\n' +
    '00201,121.471826,31.298779,虹口凉城,Hongkouliangcheng\n' +
    '00202,121.42988400000002,31.224204,静安监测站,Jinganjiancezhan\n' +
    '00203,121.70721100000002,31.188483,浦东川沙,Pudongchuansha\n' +
    '00203,121.582074,31.201591,浦东张江,Pudongzhangjiang\n' +
    '00203,121.532135,31.229537,浦东监测站,Pudongjiancezhan\n' +
    '00204,121.410728,31.234814,普陀监测站,Putuojiancezhan\n' +
    '00204,121.415416,31.160921,徐汇上师大,Xuhuishangshida\n' +
    '00206,121.538036,31.263805,杨浦四漂,Yangpusipiao\n' +
    '00207,121.482953,31.20106,上海师范专科学校附属小学,Shanghaishifanzhuankexuexiaofushuxiaoxue\n' +
    '00208,120.978,31.0935,青浦淀山湖,Qingpudianshanhu\n' +
    '00301,114.158936,30.483592,沌口新区,Dunkouxinqu\n' +
    '00302,114.130439,30.633342,吴家山,Wujiashan\n' +
    '00303,114.255924,30.557383,汉阳月湖,Hanyangyuehu\n' +
    '00305,114.281888,30.620223,汉口花桥,Hankouhuaqiao\n' +
    '00305,114.322986,30.616847,汉口江滩,Hankoujiangtan\n' +
    '00306,114.373856,30.622255,青山钢花,Qingshanganghua\n' +
    '00307,114.375132,30.573909000000004,东湖梨园,Donghuliyuan\n' +
    '00307,114.30974,30.536538,武昌紫阳,Wuchangziyang\n' +
    '00402,113.984871,22.534241,华侨城,Huaqiaocheng\n' +
    '00402,113.94556,22.491464,南油,Nanyou\n' +
    '00404,114.23687,22.557269,盐田,Yantian\n' +
    '00405,114.106793,22.563194,荔园,Liyuan\n' +
    '00405,114.117758,22.56581,洪湖,Honghu\n' +
    '00404,114.267082,22.603868,梅沙,Meisha\n' +
    '00401,114.076602,22.72016,观澜,Guanlan\n' +
    '00401,113.862238,22.575856,西乡,Xixiang\n' +
    '00403,114.496906,22.528186,南澳,Nanao\n' +
    '00403,114.247468,22.720358,龙岗,Longgang\n' +
    '00403,114.423948,22.630626,葵涌,Kuiyong\n' +
    '00501,121.589899,29.860688,太古小学,Taiguxiaoxue\n' +
    '00502,121.544194,29.86841,区环保大楼,Quhuanbaodalou\n' +
    '00503,121.558388,29.887267,三江中学,Sanjiangzhongxue\n' +
    '00504,121.716757,29.953893,龙赛医院,Longsaiyiyuan\n' +
    '00505,121.528552,29.865014,钱湖水厂,Qianhushuichang\n' +
    '00506,121.680408,29.960326,市环境监测中心,Shihuanjingjiancezhongxin\n' +
    '00505,121.568999,29.820131,万里学院,Wanlixueyuan\n' +
    '00503,121.459115,29.989265000000003,江北慈城成校,Jiangbeicichengchengxiao\n' +
    '00502,121.982324,29.905193,大榭文艺馆,Daxiewenyiguan\n' +
    '00507,121.244653,30.168252000000003,慈溪环保大楼,Cixihuanbaodalou\n' +
    '00507,121.264327,30.182249,慈溪实验小学,Cixishiyanxiaoxue\n' +
    '00508,121.158024,30.053171000000003,余姚龙山公园,Yuyaolongshangongyuan\n' +
    '00508,121.13124,30.048121,余姚七里浦水厂,Yuyaoqilipushuichang\n' +
    '00509,121.416176,29.668855,奉化环保大楼,Fenghuahuanbaodalou\n' +
    '00509,121.288975,29.695611,奉化溪口镇政府,Fenghuaxikouzhenzhengfu\n' +
    '00510,121.885564,29.473629,象山文峰小学,Xiangshanwenfengxiaoxue\n' +
    '00510,121.94853,29.206723,象山新港小学,Xiangshanxingangxiaoxue\n' +
    '00511,121.441423,29.299003000000003,宁海跃龙站,Ninghaiyuelongzhan\n' +
    '00511,121.432195,29.296298,宁海城南小学,Ninghaichengnanxiaoxue\n' +
    '00505,121.622588,29.9018,高新万里国际,Gaoxinwanliguoji\n' +
    '00601,117.185583,39.226535,淮河道,Huaihedao\n' +
    '00604,117.244978,39.110683,大直沽八号路,Dazhigubahaolu\n' +
    '00606,117.144256,39.165838,勤俭道,Qinjiandao\n' +
    '00607,117.201676,39.092699,前进道,Qianjindao\n' +
    '00609,117.373981,38.984566,津沽路,Jingulu\n' +
    '00610,117.314157,39.087569,跃进路,Yuejinlu\n' +
    '00613,117.791805,39.247742,河西一经路,Hexiyijinglu\n' +
    '00609,117.765026,39.163609,汉北路,Hanbeilu\n' +
    '00609,117.708035,39.03512,第四大街,Disidajie\n' +
    '00609,117.456722,38.841981,永明路,Yongminglu\n' +
    '00614,117.156658,38.920288,团泊洼,Tuanpowa\n' +
    '00701,106.363825,29.482157,白市驿,Baishiyi\n' +
    '00702,106.295965,29.598349,虎溪,Huxi\n' +
    '00703,106.467948,29.489218,新山村,Xinshancun\n' +
    '00704,106.509233,29.509145,鱼新街,Yuxinjie\n' +
    '00704,106.539949,29.518762,南坪,Nanping\n' +
    '00706,106.590836,29.427553000000003,蔡家,Caijia\n' +
    '00704,106.634052,29.48947,茶园,Chayuan\n' +
    '00707,106.64993,29.622061,唐家沱,Tangjiatuo\n' +
    '00708,106.5619,29.645449,礼嘉,Lijia\n' +
    '00709,106.423981,29.826376,天生,Tiansheng\n' +
    '00709,106.377439,29.827986,缙云山,Jinyunshan\n' +
    '00708,106.62555,29.723129,两路,Lianglu\n' +
    '00708,106.616892,29.712572,空港,Konggang\n' +
    '00803,104.117957,30.636121000000003,沙河铺,Shahepu\n' +
    '00804,104.176,30.68736,十里店,Shilidian\n' +
    '00805,103.97182,30.713246,金泉两河,Jinquanlianghe\n' +
    '00806,104.079,30.5706,三瓦窑,Sanwayao\n' +
    '00807,103.613,31.0283,灵岩寺,Lingyansi\n' +
    '00801,104.024,30.6564,大石西路,Dashixilu\n' +
    '00801,104.054,30.6578,君平街,Junpingjie\n' +
    '00902,113.234686,23.142228,广雅中学,Guangyazhongxue\n' +
    '00904,113.261175,23.104961,市五中,Shiwuzhong\n' +
    '00901,113.259722,23.133056,市监测站,Shijiancezhan\n' +
    '00903,113.322039,23.131667,天河职幼,Tianhezhiyou\n' +
    '00901,113.276514,23.154167,麓湖,Luhu\n' +
    '00904,113.347889,23.091389000000003,广东商学院,Guangdongshangxueyuan\n' +
    '00905,113.433222,23.104722,市八十六中,Shibashiliuzhong\n' +
    '00906,113.351553,22.9475,番禺中学,Panyuzhongxue\n' +
    '00907,113.214733,23.391667,花都师范,Huadoushifan\n' +
    '00908,113.561944,23.310833,九龙镇镇龙,Jiulongzhenzhenlong\n' +
    '00901,113.301111,23.129444,杨箕路边站,Yangjilubianzhan\n' +
    '00902,113.231389,23.116111,黄沙路边站,Huangshalubianzhan\n' +
    '00910,113.604167,22.773667,南沙科学馆,Nanshakexueguan\n' +
    '00910,113.492222,22.816667,黄阁子站,Huanggezizhan\n' +
    '00910,113.633125,22.613333,十八涌,Shibayong\n' +
    '00906,113.33675,22.909028,番禺沙湾,Panyushawan\n' +
    '00906,113.302778,23.026944,大石中学,Dashizhongxue\n' +
    '00903,113.416111,23.143889,思源中学,Siyuanzhongxue\n' +
    '00903,113.360833,23.198611,龙洞小学,Longdongxiaoxue\n' +
    '00908,113.525564,23.063233,西区子站,Xiquzizhan\n' +
    '00908,113.547225,23.203331,永和子站,Yonghezizhan\n' +
    '00908,113.425556,23.155598,科学城,Kexuecheng\n' +
    '00911,113.821389,23.287222,增城环保局,Zengchenghuanbaoju\n' +
    '00911,113.613889,23.122361,新塘镇政府,Xintangzhenzhengfu\n' +
    '00905,113.478058,23.095908,黄埔文冲,Huangpuwenchong\n' +
    '00912,113.2885,23.239108,白云嘉禾,Baiyunjiahe\n' +
    '00904,113.262175,23.088167,荔福路沙园,Lifulushayuan\n' +
    '00912,113.443333,23.303333,帽峰山,Maofengshan\n' +
    '00912,113.347778,23.368611,白云竹料,Baiyunzhuliao\n' +
    '00902,113.222778,23.078528,荔湾芳村,Liwanfangcun\n' +
    '00909,113.589,23.5538,帽峰山森林公园,Maofengshansenlingongyuan\n' +
    '00911,113.7697,23.5626,大丰门水库,Dafengmenshuiku\n' +
    '00904,113.3228,23.0724,海珠湖,Haizhuhu\n' +
    '00912,113.3007,23.1932,白云山,Baiyunshan\n' +
    '00906,113.4833,22.972,石楼镇政府,Shilouzhenzhengfu\n' +
    '00906,113.3003,22.9514,大夫山,Daifushan\n' +
    '01101,114.542,38.031,世纪公园,Shijigongyuan\n' +
    '01102,114.467,38.012,西南高教,Xinangaojiao\n' +
    '01104,114.455,38.051,职工医院,Zhigongyiyuan\n' +
    '01105,114.521,38.052,人民会堂,Renminhuitang\n' +
    '01104,114.502,38.14,西北水源,Xibeishuiyuan\n' +
    '01101,114.605,38.04,高新区,Gaoxinqu\n' +
    '01106,114.354,37.91,封龙山,Fenglongshan\n' +
    '01915,114.903,40.769,世纪豪园,Shijihaoyuan\n' +
    '01916,114.898,40.837,人民公园,Renmingongyuan\n' +
    '02001,117.966,40.916,铁路,Tielu\n' +
    '02002,117.818,40.973,文化中心,Wenhuazhongxin\n' +
    '02001,117.952,40.984,中国银行,Zhongguoyinhang\n' +
    '02001,117.938,41.011,离宫,Ligong\n' +
    '02001,117.963,40.936,开发区,Kaifaqu\n' +
    '02401,116.6447,23.6706,档案局,Danganju\n' +
    '02401,116.633889,23.671389,西园路,Xiyuanlu\n' +
    '02501,113.7944,23.0128,东城石井,Dongchengshijing\n' +
    '02502,113.748056,23.06,莞城二水厂,Guanchengershuichang\n' +
    '02501,113.7383,22.9658,南城西平,Nanchengxiping\n' +
    '02502,113.746111,23.027778,南城元岭,Nanchengyuanling\n' +
    '02501,113.781944,23.053611,东莞东城主山,Dongguandongchengzhushan\n' +
    '02601,112.8366,22.8822,高明孔堂,Gaomingkongtang\n' +
    '02602,113.1,23.0422,华材职中,Huacaizhizhong\n' +
    '02602,113.1403,23.0494,南海气象局,Nanhaiqixiangju\n' +
    '02603,113.253056,22.765556,容桂街道办,Rongguijiedaoban\n' +
    '02604,112.8858,23.1664,三水监测站,Sanshuijiancezhan\n' +
    '02604,112.8603,23.1886,三水云东海,Sanshuiyundonghai\n' +
    '02603,113.292,22.8054,顺德苏岗,Shundesugang\n' +
    '02605,113.13408,23.00476,湾梁,Wanliang\n' +
    '02605,113.10955,22.99732,惠景城,Huijingcheng\n' +
    '02603,113.26771,22.81586,金桔咀,Jinjuju\n' +
    '02602,113.15,23.0327,南海区政协,Nanhaiquzhengxie\n' +
    '02603,113.241545,22.852416,新松,Xinsong\n' +
    '02603,113.261488,22.836521,东康,Dongkang\n' +
    '02601,112.881775,22.910514000000003,高明水厂,Gaomingshuichang\n' +
    '02701,114.6944,23.7586,河源东埔,Heyuandongpu\n' +
    '02701,114.6892,23.7233,河源老城,Heyuanlaocheng\n' +
    '02801,114.5317,22.7422,大亚湾管委会,Dayawanguanweihui\n' +
    '02802,114.4183,23.0528,河南岸,Henanan\n' +
    '02801,114.3244,22.8172,惠阳船湖,Huiyangchuanhu\n' +
    '02802,114.4103,23.1142,江北,Jiangbei\n' +
    '02802,114.4053,23.08,下埔,Xiapu\n' +
    '02901,113.1036,22.6069,北街,Beijie\n' +
    '02904,113.0244,22.5325,圭峰西,Guifengxi\n' +
    '02901,113.0739,22.5811,西区,Xiqu\n' +
    '02902,113.0819,22.5931,东湖,Donghu\n' +
    '03005,116.4094,23.5292,渔湖初级中学,Yuhuchujizhongxue\n' +
    '03005,116.3697,23.5353,揭阳新兴,Jieyangxinxing\n' +
    '03004,116.3594,23.5739,揭阳东兴,Jieyangdongxing\n' +
    '03101,110.866667,21.693333,高岭,Gaoling\n' +
    '03101,110.905,21.665,健康路,Jiankanglu\n' +
    '03101,110.933333,21.651667,茂石化七小,Maoshihuaqixiao\n' +
    '03102,111.0286,21.4689,市环保局茂港分局,Shihuanbaojumaogangfenju\n' +
    '03201,116.1248,24.2654,环境监控中心,Huanjingjiankongzhongxin\n' +
    '03201,116.123333,24.328056,嘉应大学,Jiayingdaxue\n' +
    '03202,116.0797,24.2719,梅县新城,Meixianxincheng\n' +
    '03301,113.020833,23.710556,凤城街办,Fengchengjieban\n' +
    '03301,113.0425,23.6936,环保局,Huanbaoju\n' +
    '03401,116.402056,23.253639,潮南子站,Chaonanzizhan\n' +
    '03402,116.603333,23.25,潮阳子站,Chaoyangzizhan\n' +
    '03403,116.751944,23.471389,澄海子站,Chenghaizizhan\n' +
    '03404,116.725833,23.2775,濠江子站,Haojiangzizhan\n' +
    '03405,116.679444,23.366667,金平子站,Jinpingzizhan\n' +
    '03406,116.724444,23.363889,龙湖子站,Longhuzizhan\n' +
    '03501,115.3703,22.77247,汕尾市环保局,Shanweishihuanbaoju\n' +
    '03501,115.3752,22.78621,汕尾市政府,Shanweishizhengfu\n' +
    '03501,115.3677,22.78944,新城中学,Xinchengzhongxue\n' +
    '03601,113.539722,24.810833,碧湖山庄,Bihushanzhuang\n' +
    '03602,113.596389,24.686111,曲江监测站,Qujiangjiancezhan\n' +
    '03603,113.641388,24.793889,韶关学院,Shaoguanxueyuan\n' +
    '03601,113.578333,24.770833,市八中,Shibazhong\n' +
    '03603,113.606944,24.799166,园林处,Yuanlinchu\n' +
    '03701,111.949444,21.865,马南垌,Manandong\n' +
    '03701,111.950833,21.853611,南恩路,Nanenlu\n' +
    '03701,111.978611,21.858611,鸳鸯湖,Yuanyanghu\n' +
    '03801,112.053888,22.953889,牧羊,Muyang\n' +
    '03801,112.036944,22.939444,市监测站,Shijiancezhan\n' +
    '03801,112.039167,22.916944,新市府,Xinshifu\n' +
    '03901,110.401944,21.199722,环保局宿舍,Huanbaojusushe\n' +
    '03902,110.331556,21.267917,麻章区环保局,Mazhangquhuanbaoju\n' +
    '03903,110.45,21.25,坡头区环保局,Potouquhuanbaoju\n' +
    '03901,110.392778,21.222778,市环境监测站,Shihuanjingjiancezhan\n' +
    '03901,110.411111,21.202778,霞山游泳场,Xiashanyouyongchang\n' +
    '03904,110.361944,21.270555,湛江影剧院,Zhanjiangyingjuyuan\n' +
    '04001,112.4708,23.0528,城中子站,Chengzhongzizhan\n' +
    '04002,112.5653,23.1617,坑口子站,Kengkouzizhan\n' +
    '04001,112.4266,23.0705,睦岗子站,Mugangzizhan\n' +
    '04101,113.3689,22.5211,华柏园,Huabaiyuan\n' +
    '04102,113.365,22.5481,张溪,Zhangxi\n' +
    '04102,113.4336,22.4886,长江旅游区,Changjianglvyouqu\n' +
    '04102,113.4017,22.5078,紫马岭,Zimaling\n' +
    '04201,113.298833,22.228111,斗门,Doumen\n' +
    '04202,113.5736,22.2611,吉大,Jida\n' +
    '04202,113.4946,22.2294,前山,Qianshan\n' +
    '04202,113.63587,22.4212,唐家,Tangjia\n' +
    '07399,120.561,31.2472,上方山,Shangfangshan\n' +
    '07399,120.634642,31.285397,南门,Nanmen\n' +
    '07399,120.595489,31.298362,彩香,Caixiang\n' +
    '07399,120.61741,31.336065,轧钢厂,Zhagangchang\n' +
    '07399,120.613,31.2703,吴中区,Wuzhongqu\n' +
    '07399,120.543,31.2994,苏州新区,Suzhouxinqu\n' +
    '07399,120.669,31.3097,苏州工业园区,Suzhougongyeyuanqu\n' +
    '07399,120.641,31.3708,相城区,Xiangchengqu\n' +
    '07305,120.6465,31.1429,吴江环保局,Wujianghuanbaoju\n' +
    '07305,120.6373,31.1677,吴江进修学校,Wujiangjinxiuxuexiao\n' +
    '07305,120.6652,31.162,吴江开发区,Wujiangkaifaqu\n' +
    '07301,120.7511,31.6706,常熟海虞,Changshuhaiyu\n' +
    '07301,120.7416,31.6495,常熟菱塘,Changshulingtang\n' +
    '07301,120.7217,31.6663,常熟兴福,Changshuxingfu\n' +
    '07306,121.1147,31.4527,太仓监测站,Taicangjiancezhan\n' +
    '07306,121.1398,31.4236,太仓科教新城实小,Taicangkejiaoxinchengshixiao\n' +
    '07303,120.9531,31.3875,昆山第二中学,Kunshandierzhongxue\n' +
    '07303,120.9989,31.3814,昆山震川中学,Kunshanzhenchuanzhongxue\n' +
    '07302,120.5306,31.8632,张家港市监测站,Zhangjiagangshijiancezhan\n' +
    '07302,120.5602,31.8856,张家港城北小学,Zhangjiagangchengbeixiaoxue\n' +
    '07304,120.7298,31.319,方洲公园,Fangzhougongyuan\n' +
    '07804,120.242,31.5031,漆塘,Qitang\n' +
    '07803,120.354,31.5848,东亭,Dongting\n' +
    '07804,120.360119,31.540237,旺庄,Wangzhuang\n' +
    '07806,120.288,31.6842,堰桥,Yanqiao\n' +
    '07915,126.696901,45.775217,太平宏伟公园,Taipinghongweigongyuan\n' +
    '07913,126.59891,45.749521,道里建国街,Daolijianguojie\n' +
    '07916,126.626942,45.599439,平房东轻厂,Pingfangdongqingchang\n' +
    '07915,126.64169,45.76923,道外承德广场,Daowaichengdeguangchang\n' +
    '07917,126.690532,45.73472,香坊红旗大街,Xiangfanghongqidajie\n' +
    '07917,126.650042,45.726105,动力和平路,Donglihepinglu\n' +
    '07918,126.562112,45.81075,松北商业大学,Songbeishangyedaxue\n' +
    '07903,126.983977,45.54344,阿城会宁,Achenghuining\n' +
    '07902,126.596496,45.985314,呼兰师专,Hulanshizhuan\n' +
    '08010,123.937447,47.366233,安居小区,Anjuxiaoqu\n' +
    '08011,123.9553,47.341004,中心广场,Zhongxinguangchang\n' +
    '08011,123.95481200000002,47.324707,农牧车辆厂,Nongmucheliangchang\n' +
    '08012,123.632555,47.204966,富区环保局,Fuquhuanbaoju\n' +
    '08011,123.950951,47.301569,市环境监测站,Shihuanjingjiancezhan\n' +
    '08107,129.616794,44.562546000000005,环保大楼,Huanbaodalou\n' +
    '08107,129.618569,44.580122,文化广场,Wenhuaguangchang\n' +
    '08108,129.598387,44.597719,第一医院,Diyiyiyuan\n' +
    '08109,129.645705,44.610494,机车工厂,Jichegongchang\n' +
    '08110,129.645879,44.548365,第一中学,Diyizhongxue\n' +
    '08207,130.37936100000002,46.75875,四丰,Sifeng\n' +
    '08208,130.400306,46.830611,发电厂,Fadianchang\n' +
    '08207,130.32613899999998,46.797278000000006,环保局,Huanbaoju\n' +
    '08208,130.274972,46.802972,佳纺,Jiafang\n' +
    '08207,130.36480600000002,46.803194,十一中,Shiyizhong\n' +
    '08310,126.992778,46.638611,人和东街,Renhedongjie\n' +
    '08310,126.963611,46.652778000000005,党政办公中心,Dangzhengbangongzhongxin\n' +
    '08406,127.504194,50.23925,党校,Dangxiao\n' +
    '08406,127.483583,50.252667,交通局,Jiaotongju\n' +
    '08506,124.11861100000002,50.426944,环保局,Huanbaoju\n' +
    '08605,128.88583300000002,47.816111,中心医院,Zhongxinyiyuan\n' +
    '08606,128.903333,47.723056,林管局,Linguanju\n' +
    '08705,125.145897,46.580308,萨尔图区监测站,Saertuqujiancezhan\n' +
    '08705,125.122837,46.527024,龙凤区监测站,Longfengqujiancezhan\n' +
    '08706,124.870484,46.652513,让胡路区监测站,Ranghuluqujiancezhan\n' +
    '08707,124.895082,46.401694,红岗区监测站,Honggangqujiancezhan\n' +
    '08708,124.835705,46.034936,大同区监测站,Datongqujiancezhan\n' +
    '08801,130.347222,45.844444,葫头沟,Hutougou\n' +
    '08802,131.0111,45.7702,环保局,Huanbaoju\n' +
    '08803,130.8625,45.819444,新建,Xinjian\n' +
    '08904,130.92975,45.29775,气象局,Qixiangju\n' +
    '08904,130.962,45.292417,环保局,Huanbaoju\n' +
    '08904,130.981694,45.304972,自来水公司,Zilaishuigongsi\n' +
    '08904,131.0083,45.29451,白酒厂,Baijiuchang\n' +
    '09004,130.309278,47.335,东山纸板厂,Dongshanzhibanchang\n' +
    '09005,130.275722,47.335278,哈啤分公司,Hapifengongsi\n' +
    '09002,130.302861,47.506389,斯达机电,Sidajidian\n' +
    '09105,131.157222,46.588833,苗圃,Miaopu\n' +
    '09105,131.163806,46.657194,双合村,Shuanghecun\n' +
    '09105,131.16513899999998,46.619028,南小市,Nanxiaoshi\n' +
    '09105,131.15158300000002,46.646167,环保局,Huanbaoju\n' +
    '09206,125.332898,43.951075,食品厂,Shipinchang\n' +
    '09207,125.301461,43.908911,客车厂,Kechechang\n' +
    '09208,125.298349,43.856064,邮电学院,Youdianxueyuan\n' +
    '09209,125.376209,43.883357,劳动公园,Laodonggongyuan\n' +
    '09210,125.338768,43.888433,园林处,Yuanlinchu\n' +
    '09210,125.460444,43.790361,净月潭,Jingyuetan\n' +
    '09211,125.633333,43.55,甩湾子,Shuaiwanzi\n' +
    '09210,125.416667,43.866667,经开区环卫处,Jingkaiquhuanweichu\n' +
    '09208,125.25,43.816667,高新区管委会,Gaoxinquguanweihui\n' +
    '09207,125.216667,43.85,岱山公园,Daishangongyuan\n' +
    '09306,126.555,43.8875,哈达湾,Hadawan\n' +
    '09306,126.5844,43.8358,东局子,Dongjuzi\n' +
    '09307,126.4978,43.8228,电力学院,Dianlixueyuan\n' +
    '09308,126.5786,43.8947,江北,Jiangbei\n' +
    '09309,126.55,43.8256,江南公园,Jiangnangongyuan\n' +
    '09309,126.6772,43.7256,丰满,Fengman\n' +
    '09408,129.4892,42.8939,妇幼医院,Fuyouyiyuan\n' +
    '09408,129.5042,42.9061,延边医院,Yanbianyiyuan\n' +
    '09405,129.3675,42.8775,朝阳川镇医院,Zhaoyangchuanzhenyiyuan\n' +
    '09505,124.3419,43.1747,监测站,Jiancezhan\n' +
    '09506,124.3711,43.1594,一商场,Yishangchang\n' +
    '09506,124.3897,43.1847,境园,Jingyuan\n' +
    '09606,125.9361,41.7156,光明,Guangming\n' +
    '09606,125.9486,41.7381,铁路,Tielu\n' +
    '09705,122.8444,45.6289,洮北区环保局,Taobeiquhuanbaoju\n' +
    '09705,122.8211,45.6175,市环保局,Shihuanbaoju\n' +
    '09803,125.1358,42.8947,环保局,Huanbaoju\n' +
    '09803,125.1567,42.8953,污水处理厂,Wushuichulichang\n' +
    '09905,124.8292,45.0878,江南,Jiangnan\n' +
    '09905,124.8528,45.1642,江北,Jiangbei\n' +
    '10007,126.4047,41.9206,喜丰,Xifeng\n' +
    '10007,126.4078,41.9419,环保局,Huanbaoju\n' +
    '10108,123.478,41.7775,小河沿,Xiaoheyan\n' +
    '10109,123.4,41.7972,太原街,Taiyuanjie\n' +
    '10109,123.435715,41.771718,文化路,Wenhualu\n' +
    '10108,123.556557,41.821546000000005,东陵路,Donglinglu\n' +
    '10105,123.525957,41.752206,浑南东路,Hunnandonglu\n' +
    '10105,123.625945,41.80254,抚顺沈抚新城,Fushunshenfuxincheng\n' +
    '10207,121.611944,38.973889,甘井子,Ganjingzi\n' +
    '10207,121.565,38.951111,周水子,Zhoushuizi\n' +
    '10208,121.563889,38.885,星海三站,Xinghaisanzhan\n' +
    '10209,121.633056,38.911944,青泥洼桥,Qingniwaqiao\n' +
    '10210,121.625,38.863889,傅家庄,Fujiazhuang\n' +
    '10207,121.518056,38.856111,七贤岭,Qixianling\n' +
    '10211,121.258889,38.808056,旅顺,Lvshun\n' +
    '10202,121.7481,39.1311,金州,Jinzhou\n' +
    '10202,121.7769,39.0511,开发区,Kaifaqu\n' +
    '10202,121.9769,39.0631,双D港,ShuangDgang\n' +
    '10304,122.963611,41.089722,明达新区,Mingdaxinqu\n' +
    '10305,123.026248,41.135121000000005,深沟寺,Shengousi\n' +
    '10306,123.116695,41.012485,千山,Qianshan\n' +
    '10304,122.97321200000002,41.101412,铁西三道街,Tiexisandaojie\n' +
    '10306,123.013448,41.092982,太阳城,Taiyangcheng\n' +
    '10302,123.554882,40.247241,太平,Taiping\n' +
    '10404,123.796944,41.844167,大伙房水库,Dahuofangshuiku\n' +
    '10405,124.0383,41.8625,东洲区,Dongzhouqu\n' +
    '10404,123.81,41.8469,望花区,Wanghuaqu\n' +
    '10503,123.82028400000002,41.347611,威宁,Weining\n' +
    '10504,123.759167,41.290278,东明,Dongming\n' +
    '10505,123.740146,41.299494,彩屯,Caitun\n' +
    '10505,123.767647,41.329219,溪湖,Xihu\n' +
    '10503,123.812641,41.306052,大峪,Dayu\n' +
    '10503,123.80571,41.262083,新立屯,Xinlitun\n' +
    '10604,124.367794,40.111401,民主桥,Minzhuqiao\n' +
    '10605,124.39324,40.144699,元宝山,Yuanbaoshan\n' +
    '10606,124.425919,40.151168,临江后街,Linjianghoujie\n' +
    '10705,121.131697,41.139368,北湖公园,Beihugongyuan\n' +
    '10706,121.056188,40.852095,开发区,Kaifaqu\n' +
    '10707,121.120465,41.12239,天安街道,Tiananjiedao\n' +
    '10705,121.204782,41.1202,百股街道,Baigujiedao\n' +
    '10803,122.17281,40.666988,西炮台,Xipaotai\n' +
    '10803,122.216748,40.65226,镜湖西路,Jinghuxilu\n' +
    '10804,122.277248,40.707576,大庆路,Daqinglu\n' +
    '10902,121.690984,42.069146,农业园区,Nongyeyuanqu\n' +
    '10903,121.710064,42.038874,工业园区,Gongyeyuanqu\n' +
    '10902,121.661141,42.032999,玉龙新城,Yulongxincheng\n' +
    '10902,121.67613,42.026998,东苑,Dongyuan\n' +
    '11003,123.413797,41.174703,滨河路,Binhelu\n' +
    '11004,123.183182,41.258982,新华园,Xinhuayuan\n' +
    '11105,123.874963,42.294964,水上乐园,Shuishangleyuan\n' +
    '11106,123.726801,42.222668,金沙江路北,Jinshajianglubei\n' +
    '11105,123.839747,42.308996,汇工街西,Huigongjiexi\n' +
    '11205,120.41381,41.566267,八里堡,Balibao\n' +
    '11203,120.507776,41.817091,西梁,Xiliang\n' +
    '11303,122.060968,41.155037,开发区,Kaifaqu\n' +
    '11303,122.10584,41.138824,兴隆台,Xinglongtai\n' +
    '11303,121.92973899999998,41.160535,新生街道,Xinshengjiedao\n' +
    '11404,120.848651,40.721979,新区,Xinqu\n' +
    '11405,120.866584,40.773915,东城区,Dongchengqu\n' +
    '11405,120.837757,40.757419,化工街,Huagongjie\n' +
    '11507,111.651,40.7579,呼市一监,Hushiyijian\n' +
    '11507,111.658,40.8033,小召,Xiaozhao\n' +
    '11508,111.659,40.8452,兴松小区,Xingsongxiaoqu\n' +
    '11509,111.608,40.8144,糖厂,Tangchang\n' +
    '11510,111.751,40.8369,如意水处理厂,Ruyishuichulichang\n' +
    '11510,111.7277,40.8062,二十九中,Ershijiuzhong\n' +
    '11501,111.551,40.7866,工大金川校区,Gongdajinchuanxiaoqu\n' +
    '11510,111.717,40.7612,化肥厂生活区,Huafeichangshenghuoqu\n' +
    '11607,109.8756,40.6532,市环境监测站,Shihuanjingjiancezhan\n' +
    '11608,109.8104,40.6575,包百大楼,Baobaidalou\n' +
    '11609,110.0067,40.5905,东河城环局,Donghechenghuanju\n' +
    '11610,109.8538,40.6821,青山宾馆,Qingshanbinguan\n' +
    '11609,110.0377,40.5546,东河鸿龙湾,Donghehonglongwan\n' +
    '11701,106.8219,39.6719,聚英学校,Juyingxuexiao\n' +
    '11701,106.8089,39.6969,市林业局,Shilinyeju\n' +
    '11701,106.7931,39.6572,中海勃湾学校,Zhonghaibowanxuexiao\n' +
    '11811,113.1306,40.9923,集宁新区,Jiningxinqu\n' +
    '11912,122.2603,43.6267,通辽宾馆,Tongliaobinguan\n' +
    '11912,122.3039,43.6156,胶建铝业,Jiaojianlvye\n' +
    '11912,122.2532,43.6801,艺术职业学校,Yishuzhiyexuexiao\n' +
    '12014,118.9233,42.2814,松山一中,Songshanyizhong\n' +
    '12015,118.9572,42.2725,哈达街,Hadajie\n' +
    '12014,118.8789,42.2556,天义路,Tianyilu\n' +
    '12111,110.0023,39.8129,综合楼,Zonghelou\n' +
    '12111,109.9486,39.8261,巴音孟克林场办事处,Bayinmengkelinchangbanshichu\n' +
    '12109,109.7736,39.5986,康泽苑,Kangzeyuan\n' +
    '12109,109.8119,39.5989,华泰汽车城,Huataiqichecheng\n' +
    '12111,109.9734,39.7884,奥林花园,Aolinhuayuan\n' +
    '12210,107.5936,40.916,秋林养殖基地,Qiulinyangzhijidi\n' +
    '12210,107.4211,40.7608,附中,Fuzhong\n' +
    '12210,107.3715,40.7378,市环保大楼,Shihuanbaodalou\n' +
    '12315,116.1042,43.9317,市环保监测站,Shihuanbaojiancezhan\n' +
    '12315,116.0781,43.9311,市政府,Shizhengfu\n' +
    '12415,119.7594,49.2261,区环保局,Quhuanbaoju\n' +
    '12508,122.0506,46.0703,胜华新制药厂,Shenghuaxinzhiyaochang\n' +
    '12507,121.9462,46.0756,科右前旗环保局,Keyouqianqihuanbaoju\n' +
    '12612,105.6775,38.8343,体育场,Tiyuchang\n' +
    '12612,105.6975,38.843,盟环保楼,Menghuanbaolou\n' +
    '12612,105.724,38.8516,环保局新楼,Huanbaojuxinlou\n' +
    '14906,117.048611,36.662222,市监测站,Shijiancezhan\n' +
    '14906,117.021111,36.661389,泉城广场,Quanchengguangchang\n' +
    '14907,116.988056,36.611389,科干所,Kegansuo\n' +
    '14908,116.945,36.663,农科所,Nongkesuo\n' +
    '14909,116.947778,36.700278,兰翔技校,Lanxiangjixiao\n' +
    '14909,116.988611,36.687222,化工厂,Huagongchang\n' +
    '14910,117.060278,36.685278,省种子仓库,Shengzhongzicangku\n' +
    '14911,116.765167,36.548611,长清区委党校,Zhangqingquweidangxiao\n' +
    '14912,117.124722,36.685389,开发区,Kaifaqu\n' +
    '15007,120.403259,36.06525,市南区东部,Shinanqudongbu\n' +
    '15007,120.294134,36.054169,市南区西部,Shinanquxibu\n' +
    '15008,120.336184,36.069711,市北区南部,Shibeiqunanbu\n' +
    '15008,120.36125,36.103886,市北区北部,Shibeiqubeibu\n' +
    '15009,120.185909,35.958797,黄岛区南部,Huangdaoqunanbu\n' +
    '15009,120.155109,35.970289,黄岛区北部,Huangdaoqubeibu\n' +
    '15010,120.446784,36.085636,崂山区西部,Laoshanquxibu\n' +
    '15010,120.48547,36.090925,崂山区中部,Laoshanquzhongbu\n' +
    '15011,120.380186,36.18457,李沧区北部,Licangqubeibu\n' +
    '15012,120.39492,36.308156,城阳区北部,Chengyangqubeibu\n' +
    '15101,117.923333,36.665556,凤凰山,Fenghuangshan\n' +
    '15108,118.042222,36.808333000000005,人民公园,Renmingongyuan\n' +
    '15108,118.044722,36.838056,东风化工厂,Dongfenghuagongchang\n' +
    '15108,118.0175,36.843333,新区,Xinqu\n' +
    '15108,118.024444,36.803056,南定,Nanding\n' +
    '15102,117.847778,36.497222,博山双山,Boshanshuangshan\n' +
    '15102,117.870278,36.459722,青龙山,Qinglongshan\n' +
    '15107,118.309167,36.819722,临淄莆田园,Linziputianyuan\n' +
    '15107,118.249167,36.765556,齐鲁石化,Qilushihua\n' +
    '15104,117.85111100000002,36.804167,周村三金集团,Zhoucunsanjinjituan\n' +
    '15104,117.920556,36.825,职业学院,Zhiyexueyuan\n' +
    '15211,116.308333,37.465278000000005,黑马集团,Heimajituan\n' +
    '15211,116.371389,37.432222,监测站,Jiancezhan\n' +
    '15211,116.310556,37.478056,双一集团,Shuangyijituan\n' +
    '15311,121.371706,37.543111,轴承厂,Zhouchengchang\n' +
    '15311,121.355367,37.523683,鲁东大学,Ludongdaxue\n' +
    '15307,121.255093,37.471414,福山区监测站,Fushanqujiancezhan\n' +
    '15308,121.581726,37.376055,牟平区环保局,Mupingquhuanbaoju\n' +
    '15312,121.44307,37.477439,莱山区环保局,Laishanquhuanbaoju\n' +
    '15313,121.142166,37.602407,开发区B 区,KaifaquB qu\n' +
    '15313,121.066251,37.672833,大季家,Dajijia\n' +
    '15314,121.50684,37.422767,中国农业大学,Zhongguonongyedaxue\n' +
    '15409,119.091944,36.730556,刘家园,Liujiayuan\n' +
    '15409,119.048167,36.719556,经济开发区,Jingjikaifaqu\n' +
    '15409,119.099944,36.681944,商校,Shangxiao\n' +
    '15410,119.19388899999998,36.773056,寒亭区,Hantingqu\n' +
    '15411,119.161389,36.657222,共达公司,Gongdagongsi\n' +
    '15412,119.1625,36.700833,市环保局,Shihuanbaoju\n' +
    '15412,119.14,36.701944,市仲裁委,Shizhongcaiwei\n' +
    '15413,119.109567,36.773056,锦程中学,Jinchengzhongxue\n' +
    '15512,116.547611,35.390889,电化厂,Dianhuachang\n' +
    '15512,116.596389,35.442778000000004,农业学校,Nongyexuexiao\n' +
    '15513,116.693611,35.425056,圣地度假村,Shengdidujiacun\n' +
    '15515,116.637611,35.436778000000004,开发区火炬城,Kaifaquhuojucheng\n' +
    '15605,117.153611,36.194167,泰山监测站,Taishanjiancezhan\n' +
    '15605,117.118056,36.175833,山东电力学校,Shandongdianlixuexiao\n' +
    '15605,117.098056,36.194167,人口学校,Renkouxuexiao\n' +
    '15605,117.184167,36.204722,厚丰公司,Houfenggongsi\n' +
    '15605,117.041111,36.201944,交通技校,Jiaotongjixiao\n' +
    '15710,118.293889,35.062222,鲁南制药厂,Lunanzhiyaochang\n' +
    '15710,118.341667,35.057222,沂河小区,Yihexiaoqu\n' +
    '15710,118.287778,35.115278,临沂大学,Linyidaxue\n' +
    '15710,118.347778,35.105278000000006,市环保局(南坊),Shihuanbaoju(nanfang)\n' +
    '15711,118.276389,34.981667,新光毛纺厂,Xinguangmaofangchang\n' +
    '15712,118.402333,35.089721999999995,河东保险公司,Hedongbaoxiangongsi\n' +
    '15809,115.422778,35.248889,气象局,Qixiangju\n' +
    '15809,115.408611,35.243611,牡丹高新区,Mudangaoxinqu\n' +
    '15809,115.455,35.27,菏泽学院,Hezexueyuan\n' +
    '15810,115.525833,35.223056,污水处理厂,Wushuichulichang\n' +
    '15810,115.474722,35.2375,市政协,Shizhengxie\n' +
    '15810,115.519167,35.261944,华润制药,Huarunzhiyao\n' +
    '15907,118.020833,37.379444,市环保局,Shihuanbaoju\n' +
    '15907,117.983056,37.383056,北中新校,Beizhongxinxiao\n' +
    '15907,117.996667,37.360833,第二水厂,Diershuichang\n' +
    '15907,117.937778,37.395556,科灵化工,Kelinghuagong\n' +
    '15907,117.9375,37.355556,银河物流,Yinhewuliu\n' +
    '15907,117.973056,37.3675,碧林小区,Bilinxiaoqu\n' +
    '16005,118.667222,37.431389,市环保局,Shihuanbaoju\n' +
    '16005,118.625,37.438056,职业学院,Zhiyexueyuan\n' +
    '16006,118.552778,37.444444,耿井村,Gengjingcun\n' +
    '16006,118.502222,37.465833,市环保公司,Shihuanbaogongsi\n' +
    '16006,118.640833,37.472222,胜利医院,Shengliyiyuan\n' +
    '16001,118.516389,37.883056,河口区,Hekouqu\n' +
    '16007,118.69611100000002,37.434444,开发区,Kaifaqu\n' +
    '16106,122.062005,37.512926,市环境监测站,Shihuanjingjiancezhan\n' +
    '16106,122.141257,37.513634,蓝天宾馆,Lantianbinguan\n' +
    '16107,122.125771,37.426947,华夏技校,Huaxiajixiao\n' +
    '16205,117.563889,34.851389000000005,市中区政府,Shizhongquzhengfu\n' +
    '16205,117.589722,34.82,污水处理厂,Wushuichulichang\n' +
    '16201,117.266667,34.791111,薛城区环保局,Xuechengquhuanbaoju\n' +
    '16202,117.570833,34.773889000000004,峄城区政府,Yichengquzhengfu\n' +
    '16203,117.735278,34.580556,台儿庄环保局,Taierzhuanghuanbaoju\n' +
    '16206,117.451667,35.070833,山亭区环保局,Shantingquhuanbaoju\n' +
    '16207,117.314722,34.810278000000004,市环保局,Shihuanbaoju\n' +
    '16208,117.3575,34.8225,高新区,Gaoxinqu\n' +
    '16303,119.520556,35.407778,市政府广场,Shizhengfuguangchang\n' +
    '16303,119.490833,35.388889,市监测站,Shijiancezhan\n' +
    '16303,119.56888899999998,35.4625,教授花园,Jiaoshouhuayuan\n' +
    '16303,119.532778,35.442221999999994,职业技术学院,Zhiyejishuxueyuan\n' +
    '16305,119.50861100000002,35.373611,金马工业园,Jinmagongyeyuan\n' +
    '16401,117.695,36.205,植物油厂,Zhiwuyouchang\n' +
    '16402,117.725,36.208056,日晟国际学校,Richengguojixuexiao\n' +
    '16508,115.966111,36.444444,东昌区政府,Dongchangquzhengfu\n' +
    '16508,115.996667,36.456667,二轻机械厂,Erqingjixiechang\n' +
    '16508,115.983611,36.479444,市委党校,Shiweidangxiao\n' +
    '16508,115.954722,36.471111,洪顺花园,Hongshunhuayuan\n' +
    '16606,87.5801,43.8303,监测站,Jiancezhan\n' +
    '16607,87.6046,43.768,收费所,Shoufeisuo\n' +
    '16608,87.4754,43.9469,新疆农科院农场,Xinjiangnongkeyuannongchang\n' +
    '16608,87.5525,43.8711,铁路局,Tieluju\n' +
    '16609,87.6432,43.831,三十一中学,Sanshiyizhongxue\n' +
    '16611,87.6444,43.962,米东区环保局,Midongquhuanbaoju\n' +
    '16702,84.123333,45.688333,白碱滩区,Baijiantanqu\n' +
    '16703,84.886111,45.603333,长征新村,Changzhengxincun\n' +
    '16704,84.904167,44.342778,独山子区,Dushanziqu\n' +
    '16705,85.692613,46.089847,乌尔禾区商贸楼,Wuerhequshangmaolou\n' +
    '16703,84.888889,45.599722,南林小区,Nanlinxiaoqu\n' +
    '16801,86.0497,44.2967,艾青诗歌馆,Aiqingshigeguan\n' +
    '16801,86.0697,44.3075,阳光学校,Yangguangxuexiao\n' +
    '17503,81.2815,43.9404,哈萨克市环保局,Hasakeshihuanbaoju\n' +
    '17503,81.2867,43.895,哈萨克新政府片区,Hasakexinzhengfupianqu\n' +
    '17503,81.3364,43.941,哈萨克第二水厂,Hasakediershuichang\n' +
    '18004,76.1861,39.7153,市人民政府,Shirenminzhengfu\n' +
    '18208,91.13,29.6514,市环保局,Shihuanbaoju\n' +
    '18904,101.753782,36.590489,市环境监测站,Shihuanjingjiancezhan\n' +
    '18906,101.847291,36.578752,四陆医院,Siluyiyuan\n' +
    '18905,101.778228,36.617144,第五水厂,Diwushuichang\n' +
    '19104,102.0199,35.5102,同仁子站,Tongrenzizhan\n' +
    '19205,100.6188,36.2866,共和子站,Gonghezizhan\n' +
    '19307,100.2561,34.4714,果洛子站,Guoluozizhan\n' +
    '19406,97.0,33.0014,玉树子站,Yushuzizhan\n' +
    '19505,97.3731,37.3753,德令哈子站,Delinghazizhan\n' +
    '19603,100.9048,36.9639,西海子站,Xihaizizhan\n' +
    '19805,103.631,36.1031,兰炼宾馆,Lanlianbinguan\n' +
    '19806,103.841,36.0725,生物制品所,Shengwuzhipinsuo\n' +
    '19806,103.831,36.0464,铁路设计院,Tielushejiyuan\n' +
    '19907,104.6228,35.5714,监测站（原粮食局）,Jiancezhan（yuanliangshiju）\n' +
    '19907,104.6169,35.5975,南峰招待所（原起重机厂）,Nanfengzhaodaisuo（yuanqizhongjichang）\n' +
    '20007,106.6692,35.5461,监测站,Jiancezhan\n' +
    '20007,106.7039,35.5294,博物馆,Bowuguan\n' +
    '20108,107.6406,35.5236,粮贸总公司,Liangmaozonggongsi\n' +
    '20108,107.6364,35.7067,市环保局,Shihuanbaoju\n' +
    '20204,102.6219,37.9311,监测站,Jiancezhan\n' +
    '20302,102.1725,38.5339,新川苑,Xinchuanyuan\n' +
    '20406,100.4497,38.9389,科委,Kewei\n' +
    '20406,100.4686,38.9467,监测站,Jiancezhan\n' +
    '20507,98.509,39.746,仓门街子站,Cangmenjiezizhan\n' +
    '20507,98.5023,39.7294,富康家世界子站,Fukangjiashijiezizhan\n' +
    '20607,105.7281,34.5814,进步巷,Jinbuxiang\n' +
    '21005,104.1731,36.5458,豫源饭店,Yuyuanfandian\n' +
    '21005,104.1731,36.5481,动力公司,Dongligongsi\n' +
    '21101,98.290554,39.771835,气象局,Qixiangju\n' +
    '21708,113.616,34.921,岗李水库,Ganglishuiku\n' +
    '21709,113.678,34.808,银行学校,Yinhangxuexiao\n' +
    '21709,113.738,34.773,四十七中,Sishiqizhong\n' +
    '21710,113.674,34.741,烟厂,Yanchang\n' +
    '21712,113.588,34.758,市监测站,Shijiancezhan\n' +
    '21709,113.653,34.771,郑纺机,Zhengfangji\n' +
    '21712,113.57,34.807,供水公司,Gongshuigongsi\n' +
    '21805,114.369739,36.107634,市红庙街,Shihongmiaojie\n' +
    '21806,114.50548899999998,36.093528000000006,市棉研所,Shimianyansuo\n' +
    '21807,114.371948,36.074561,市银杏小区,Shiyinxingxiaoqu\n' +
    '21808,114.30599,36.110488,市铁佛寺,Shitiefosi\n' +
    '21908,113.926975,35.302928,环保东院,Huanbaodongyuan\n' +
    '21910,113.9027,35.281993,开发区,Kaifaqu\n' +
    '21908,113.926975,35.302928,环保西院,Huanbaoxiyuan\n' +
    '22405,114.380156,34.796576,妇幼保健院,Fuyoubaojianyuan\n' +
    '22407,114.29691499999998,34.79452,世纪星幼儿园,Shijixingyoueryuan\n' +
    '22406,114.3389,34.7781,肿瘤医院,Zhongliuyiyuan\n' +
    '22512,112.384444,34.623056,开发区管委会,Kaifaquguanweihui\n' +
    '22513,112.426667,34.624722,市委新办公区,Shiweixinbangongqu\n' +
    '22512,112.393889,34.651111,市委党校,Shiweidangxiao\n' +
    '22514,112.503333,34.686667,河南林校,Henanlinxiao\n' +
    '22512,112.362778,34.669167,中信二小,Zhongxinerxiao\n' +
    '22515,112.466389,34.686944,豫西宾馆,Yuxibinguan\n' +
    '22608,115.6697,34.4286,环境监测站,Huanjingjiancezhan\n' +
    '22608,115.6558,34.429,粮食局,Liangshiju\n' +
    '22609,115.6386,34.407,睢阳区环保局,Suiyangquhuanbaoju\n' +
    '22609,115.6578,34.402,第三人民医院,Disanrenminyiyuan\n' +
    '23306,111.1928,34.7772,市政府,Shizhengfu\n' +
    '23306,111.158,34.794,开发区,Kaifaqu\n' +
    '23607,120.913,31.96,南郊,Nanjiao\n' +
    '23607,120.86,32.0005,虹桥,Hongqiao\n' +
    '23607,120.87,32.02,城中,Chengzhong\n' +
    '23607,120.94,31.93,星湖花园,Xinghuhuayuan\n' +
    '23608,120.81,32.0417,紫琅学院,Zilangxueyuan\n' +
    '23705,119.40444,32.409440000000004,监测站,Jiancezhan\n' +
    '23705,119.43917,32.40333,四院,Siyuan\n' +
    '23705,119.38861,32.37611,邗江监测站,Hanjiangjiancezhan\n' +
    '23809,120.118,33.4022,盐城电厂,Yanchengdianchang\n' +
    '23809,120.156,33.3942,市监测站,Shijiancezhan\n' +
    '23809,120.129,33.3719,文峰中学,Wenfengzhongxue\n' +
    '23809,120.225,33.3947,开发区管委会,Kaifaquguanweihui\n' +
    '24007,119.036,33.5981,钵池山,Bochishan\n' +
    '24008,119.007,33.575,北京南路,Beijingnanlu\n' +
    '24007,118.989,33.6067,市监测站,Shijiancezhan\n' +
    '24006,119.135,33.5039,楚州区监测站,Chuzhouqujiancezhan\n' +
    '24005,119.0122,33.627,淮阴区监测站,Huaiyinqujiancezhan\n' +
    '24105,119.176,34.5885,市环境监测站,Shihuanjingjiancezhan\n' +
    '24107,119.368,34.7507,墟沟核电专家村,Xugouhedianzhuanjiacun\n' +
    '24204,119.996,31.7586,市监测站,Shijiancezhan\n' +
    '24205,119.933,31.7786,城建学校,Chengjianxuexiao\n' +
    '24206,120.0393,31.7638,潞城,Lucheng\n' +
    '24207,119.935,31.7039,武进监测站,Wujinjiancezhan\n' +
    '24208,119.905,31.9108,安家,Anjia\n' +
    '24208,119.962,31.8089,常工院,Changgongyuan\n' +
    '24405,118.293,33.9528,宿迁学院,Suqianxueyuan\n' +
    '24405,118.2442,33.9592,宿迁中学,Suqianzhongxue\n' +
    '24404,118.3214,33.9506,宿豫区环保局,Suyuquhuanbaoju\n' +
    '25211,111.3548,30.64627,伍家岗,Wujiagang\n' +
    '25212,111.3008,30.71569,四零三,Silingsan\n' +
    '25212,111.2992,30.698,白龙岗,Bailonggang\n' +
    '25213,111.268,30.695970000000003,点军区,Dianjunqu\n' +
    '25210,111.3295,30.78186,夷陵区,Yilingqu\n' +
    '26108,120.128,30.246,卧龙桥,Wolongqiao\n' +
    '26109,120.171,30.288,朝晖五区,Zhaohuiwuqu\n' +
    '26110,120.210833,30.21,滨江,Binjiang\n' +
    '26111,120.119722,30.311944,和睦小学,Hemuxiaoxue\n' +
    '26112,120.193,30.268,浙江农大,Zhejiangnongda\n' +
    '26112,120.348056,30.305833000000003,下沙,Xiasha\n' +
    '26108,120.088333,30.180833000000003,云栖,Yunqi\n' +
    '26108,120.063333,30.274722,西溪,Xixi\n' +
    '26113,120.269722,30.181944,城厢镇,Chengxiangzhen\n' +
    '26114,120.300556,30.418333,临平镇,Linpingzhen\n' +
    '26107,119.9518,30.0469,富阳市镇二中,Fuyangshizhenerzhong\n' +
    '26106,119.718611,30.236667,临安市市府大楼,Linanshishifudalou\n' +
    '26106,119.694722,30.231944,临安市第四中学,Linanshidisizhongxue\n' +
    '26103,119.025965,29.640581,千岛湖,Qiandaohu\n' +
    '26204,120.115328,30.862005,吉山新村,Jishanxincun\n' +
    '26204,120.079708,30.864437,城西水厂,Chengxishuichang\n' +
    '26306,120.730691,30.747405,嘉兴学院,Jiaxingxueyuan\n' +
    '26306,120.743647,30.777969,清河小学,Qinghexiaoxue\n' +
    '26405,120.580238,30.004331,市环保站,Shihuanbaozhan\n' +
    '26405,120.609511,29.989283,城东开发委,Chengdongkaifawei\n' +
    '26405,120.61746200000002,30.078374,袍江站,Paojiangzhan\n' +
    '26508,121.41888,28.654166,台州环保大楼,Taizhouhuanbaodalou\n' +
    '26510,121.376778,28.577361,路桥田洋王,Luqiaotianyangwang\n' +
    '26509,121.280823,28.659261,黄岩环保大楼,Huangyanhuanbaodalou\n' +
    '26609,120.675116,28.013044,市站,Shizhan\n' +
    '26610,120.638037,28.005239000000003,瓯海,Ouhai\n' +
    '26611,120.764294,27.971359000000003,龙湾,Longwan\n' +
    '26610,120.679665,27.985079,南浦,Nanpu\n' +
    '26709,119.879444,28.423056,余庄前,Yuzhuangqian\n' +
    '26709,119.9187,28.447794,监测站大楼,Jiancezhandalou\n' +
    '26709,119.934922,28.454307,莲都小学,Liandouxiaoxue\n' +
    '26808,119.685611,29.102917,金华市市监测站,Jinhuashishijiancezhan\n' +
    '26809,119.647417,29.077,十五中,Shiwuzhong\n' +
    '26803,120.078611,29.335364,义乌市北苑,Yiwushibeiyuan\n' +
    '26803,120.090556,29.304964,义乌市江东,Yiwushijiangdong\n' +
    '26906,118.871306,28.940417,环保大楼,Huanbaodalou\n' +
    '26906,118.876145,28.964613,实验学校,Shiyanxuexiao\n' +
    '26906,118.85525,28.974528000000003,衢州学院,Quzhouxueyuan\n' +
    '27004,122.189722,29.994444,临城新区,Linchengxinqu\n' +
    '27003,122.3135,29.95378,普陀东港,Putuodonggang\n' +
    '27004,122.122222,30.020278,定海檀枫,Dinghaitanfeng\n' +
    '27103,117.196,31.7848,明珠广场,Mingzhuguangchang\n' +
    '27106,117.307,31.8766,三里街,Sanlijie\n' +
    '27107,117.259,31.8706,琥珀山庄,Huposhanzhuang\n' +
    '27108,117.16,31.9051,董铺水库,Dongpushuiku\n' +
    '27107,117.25,31.8572,长江中路,Changjiangzhonglu\n' +
    '27108,117.266,31.9438,庐阳区,Luyangqu\n' +
    '27106,117.336,31.8585,瑶海区,Yaohaiqu\n' +
    '27109,117.302,31.7956,包河区,Baohequ\n' +
    '27109,117.278,31.7386,滨湖新区,Binhuxinqu\n' +
    '27107,117.124,31.8516,高新区,Gaoxinqu\n' +
    '27204,117.3961,32.939,工人疗养院,Gongrenliaoyangyuan\n' +
    '27205,117.3575,32.9444,百货大楼,Baihuodalou\n' +
    '27206,117.3086,32.935,二水厂,Ershuichang\n' +
    '27204,117.4186,32.8913,蚌埠学院,Bengbuxueyuan\n' +
    '27207,117.3536,32.9673,淮上区政府,Huaishangquzhengfu\n' +
    '27206,117.3065,32.8985,高新区,Gaoxinqu\n' +
    '27305,118.3528,31.3508,监测站,Jiancezhan\n' +
    '27306,118.3708,31.3178,四水厂,Sishuichang\n' +
    '27307,118.4022,31.3839,五七二零厂,Wuqierlingchang\n' +
    '27307,118.37567,31.41293,科创中心,Kechuangzhongxin\n' +
    '27402,116.8028,32.7639,潘集区政府,Panjiquzhengfu\n' +
    '27403,117.0083,32.645,师范学院,Shifanxueyuan\n' +
    '27404,116.8556,32.6028,谢家集区政府,Xiejiajiquzhengfu\n' +
    '27405,116.8306,32.6319,八公山区政府,Bagongshanquzhengfu\n' +
    '27401,116.7039,32.625,焦岗湖风景区管理处,Jiaoganghufengjingquguanlichu\n' +
    '27504,118.5058,31.6861,湖东路四小,Hudonglusixiao\n' +
    '27505,118.4828,31.6411,天平服装,Tianpingfuzhuang\n' +
    '27504,118.5106,31.7506,慈湖二小,Cihuerxiao\n' +
    '27505,118.48,31.6928,马钢动力厂,Magangdonglichang\n' +
    '27504,118.6439,31.7133,市教育基地,Shijiaoyujidi\n' +
    '27609,117.0549,30.5103,环科院,Huankeyuan\n' +
    '27610,117.0299,30.5159,马山宾馆,Mashanbinguan\n' +
    '27611,117.0486,30.5489,联富花园,Lianfuhuayuan\n' +
    '27611,116.9894,30.6145,安庆大学,Anqingdaxue\n' +
    '27705,116.9765,33.6481,监测楼,Jiancelou\n' +
    '27705,116.9677,33.6284,一中,Yizhong\n' +
    '27705,116.9686,33.6401,火车站,Huochezhan\n' +
    '27806,115.8275,32.8928,市监测站,Shijiancezhan\n' +
    '27806,115.8556,32.8603,开发区,Kaifaqu\n' +
    '27904,115.8067,33.8399,污水处理厂,Wushuichulichang\n' +
    '27904,115.7831,33.8561,三国揽胜宫,Sanguolanshenggong\n' +
    '28002,118.3057,29.7128,延安路89号,Yananlu89hao\n' +
    '28002,118.3236,29.7207,黄山东路89号,Huangshandonglu89hao\n' +
    '28001,118.1371,30.2756,黄山区政府5号楼,Huangshanquzhengfu5haolou\n' +
    '28107,118.3094,32.3153,老年大学,Laoniandaxue\n' +
    '28107,118.3244,32.2786,人大宾馆,Rendabinguan\n' +
    '28107,118.3158,32.3061,监测站,Jiancezhan\n' +
    '28202,116.8008,33.975,监测站,Jiancezhan\n' +
    '28203,116.8067,33.8997,烈山区政府,Lieshanquzhengfu\n' +
    '28202,116.7844,33.9461,职业技术学院,Zhiyejishuxueyuan\n' +
    '28301,117.8178,30.9414,第四中学,Disizhongxue\n' +
    '28301,117.8078,30.9222,公路局,Gongluju\n' +
    '28302,117.7806,30.9414,新民污水厂,Xinminwushuichang\n' +
    '28301,117.7442,30.8811,第九中学,Dijiuzhongxue\n' +
    '28303,117.8561,30.9219,车站新区,Chezhanxinqu\n' +
    '28407,118.7581,30.9447,宣城鳌峰子站,Xuanchengaofengzizhan\n' +
    '28407,118.7386,30.9742,宣城敬亭山子站,Xuanchengjingtingshanzizhan\n' +
    '28407,118.7175,30.9431,宣城开发区子站,Xuanchengkaifaquzizhan\n' +
    '28506,116.508,31.7371,监测大楼,Jiancedalou\n' +
    '28507,116.478,31.7618,皖西学院,Wanxixueyuan\n' +
    '28506,116.5068,31.7797,朝阳厂,Zhaoyangchang\n' +
    '28506,116.5661,31.7712,开发区,Kaifaqu\n' +
    '28605,117.4697,30.6617,池州学院,Chizhouxueyuan\n' +
    '28605,117.4974,30.6539,平天湖,Pingtianhu\n' +
    '28709,119.352919,26.072105,鼓山,Gushan\n' +
    '28711,119.309506,26.038712,师大,Shida\n' +
    '28712,119.308179,26.086796,五四北路,Wusibeilu\n' +
    '28712,119.266218,26.076795,杨桥西路,Yangqiaoxilu\n' +
    '28709,119.324574,26.076788,紫阳,Ziyang\n' +
    '28802,118.151389,24.476667000000003,洪文,Hongwen\n' +
    '28802,118.063611,24.445833,鼓浪屿,Gulangyu\n' +
    '28801,118.156944,24.818056,溪东,Xidong\n' +
    '28909,119.5001,26.6946,金涵水库,Jinhanshuiku\n' +
    '28909,119.5202,26.6607,蕉城区农机局,Jiaochengqunongjiju\n' +
    '28909,119.5392,26.6611,宁德市监测站,Ningdeshijiancezhan\n' +
    '29005,119.0156,25.442,荔城区仓后路,Lichengqucanghoulu\n' +
    '29005,119.0018,25.4552,莆田市监测站,Putianshijiancezhan\n' +
    '29003,119.1117,25.4556,涵江区六中,Hanjiangquliuzhong\n' +
    '29006,119.1015,25.3214,秀屿区政府,Xiuyuquzhengfu\n' +
    '29005,118.981,25.4792,东圳水库,Dongzhenshuiku\n' +
    '29109,118.593889,24.9425,清源山,Qingyuanshan\n' +
    '29110,118.581944,24.911667,涂山街,Tushanjie\n' +
    '29109,118.60138899999998,24.898889,津头埔,Jintoupu\n' +
    '29101,118.6663,24.9424,万安,Wanan\n' +
    '29211,117.6569,24.5157,漳州三中,Zhangzhousanzhong\n' +
    '29204,117.6336,24.4674,九湖,Jiuhu\n' +
    '29307,117.0181,25.1174,龙岩师专,Longyanshizhuan\n' +
    '29307,117.0216,25.1035,龙岩市监测站,Longyanshijiancezhan\n' +
    '29307,117.0256,25.0661,闽西职业技术学院,Minxizhiyejishuxueyuan\n' +
    '29307,117.0151,25.0311,龙岩学院,Longyanxueyuan\n' +
    '29411,117.6211,26.2625,三钢,Sangang\n' +
    '29411,117.6353,26.2708,三明二中,Sanmingerzhong\n' +
    '29412,117.6028,26.2378,三元区政府,Sanyuanquzhengfu\n' +
    '29411,117.7275,26.3108,洋溪,Yangxi\n' +
    '29510,118.0966,26.6761,茫荡山,Mangdangshan\n' +
    '29510,118.1694,26.6383,南平市监测站,Nanpingshijiancezhan\n' +
    '29510,118.1819,26.6514,南平铝业有限公司,Nanpinglvyeyouxiangongsi\n' +
    '29510,118.1756,26.6272,南平七中,Nanpingqizhong\n' +
    '29605,115.898595,28.681395,省外办,Shengwaiban\n' +
    '29605,115.8937,28.694009,省林业公司,Shenglinyegongsi\n' +
    '29606,115.819781,28.734747,林科所,Linkesuo\n' +
    '29606,115.96782,28.683932,京东镇政府,Jingdongzhenzhengfu\n' +
    '29605,115.860996,28.68735,建工学校,Jiangongxuexiao\n' +
    '29607,115.898462,28.641221,象湖,Xianghu\n' +
    '29608,115.747755,28.797646000000004,武术学校,Wushuxuexiao\n' +
    '29606,115.937041,28.680496,省站,Shengzhan\n' +
    '29702,115.993866,29.577697,庐山气象台,Lushanqixiangtai\n' +
    '29702,115.987332,29.670709,十里,Shili\n' +
    '29711,115.962209,29.703471,茅山头,Maoshantou\n' +
    '29711,115.993136,29.72649,西园,Xiyuan\n' +
    '29702,116.017576,29.643308,五七二七厂,Wuqierqichang\n' +
    '29702,116.06284,29.681569,水科所,Shuikesuo\n' +
    '29712,115.911425,29.594804,综合工业园,Zonghegongyeyuan\n' +
    '29702,116.089365,29.741185,石化总厂,Shihuazongchang\n' +
    '29812,118.0058,28.4569,百草园,Baicaoyuan\n' +
    '29812,117.973,28.4459,市监测站,Shijiancezhan\n' +
    '29812,117.9511,28.4622,凤凰光学,Fenghuangguangxue\n' +
    '29806,117.9033,28.4303,开发区管委会,Kaifaquguanweihui\n' +
    '29911,116.3553,27.9883,市站,Shizhan\n' +
    '29911,116.3598,27.9639,血防站,Xuefangzhan\n' +
    '29911,116.3574,28.0005,采茶剧团,Caichajutuan\n' +
    '29911,116.385,27.9647,医学分院,Yixuefenyuan\n' +
    '30010,114.3442,27.8036,槟榔水业,Binglangshuiye\n' +
    '30010,114.3806,27.8014,中国银行,Zhongguoyinhang\n' +
    '30010,114.3953,27.7842,石油公司,Shiyougongsi\n' +
    '30010,114.3703,27.7914,气象局,Qixiangju\n' +
    '30010,114.4011,27.8072,广电局,Guangdianju\n' +
    '30113,114.9817,27.0658,红声器材厂,Hongshengqicaichang\n' +
    '30113,114.9739,27.11,森林工业局,Senlingongyeju\n' +
    '30113,114.99,27.1311,市环境监测站,Shihuanjingjiancezhan\n' +
    '30114,115.0075,27.0983,青原区法院,Qingyuanqufayuan\n' +
    '30218,114.9064,25.9118,通天岩,Tongtianyan\n' +
    '30218,114.9367,25.8664,地委,Diwei\n' +
    '30218,114.9461,25.8481,气象台,Qixiangtai\n' +
    '30218,114.9322,25.8333,市图书馆,Shitushuguan\n' +
    '30218,114.8905,25.8471,华坚鞋城,Huajianxiecheng\n' +
    '30302,117.3097,29.3864,王岗中学,Wanggangzhongxue\n' +
    '30303,117.2111,29.2958,老干部活动中心,Laoganbuhuodongzhongxin\n' +
    '30304,117.1983,29.2786,兽医站,Shouyizhan\n' +
    '30304,117.1558,29.2647,台达陶瓷,Taidataoci\n' +
    '30303,117.2461,29.2956,陶研所,Taoyansuo\n' +
    '30403,113.8381,27.6428,中医院,Zhongyiyuan\n' +
    '30403,113.8447,27.6231,市政府车库,Shizhengfucheku\n' +
    '30403,113.865,27.6178,安源区政府,Anyuanquzhengfu\n' +
    '30403,113.86861100000002,27.644166,市环保局站,Shihuanbaojuzhan\n' +
    '30406,114.261028,27.49475,武功山站,Wugongshanzhan\n' +
    '30502,114.995088,27.847993,飞宇,Feiyu\n' +
    '30502,114.91214,27.814478,新钢氧气厂,Xingangyangqichang\n' +
    '30502,115.098468,27.935601,北岗,Beigang\n' +
    '30502,114.929052,27.843027000000003,第二水厂,Diershuichang\n' +
    '30502,114.931642,27.813922,市气象局,Shiqixiangju\n' +
    '30602,116.9622,28.095,龙虎山,Longhushan\n' +
    '30603,117.0564,28.2642,新监测站,Xinjiancezhan\n' +
    '30603,117.0281,28.2403,财苑宾馆,Caiyuanbinguan\n' +
    '30603,117.0222,28.2264,体育馆,Tiyuguan\n' +
    '30603,116.9983,28.2169,三川水表,Sanchuanshuibiao\n' +
    '30705,113.082,28.2422,经开区环保局,Jingkaiquhuanbaoju\n' +
    '30706,112.888,28.2203,高开区环保局,Gaokaiquhuanbaoju\n' +
    '30707,113.078,28.2011,马坡岭,Mapoling\n' +
    '30706,112.944,28.1897,湖南师范大学,Hunanshifandaxue\n' +
    '30708,113.003,28.143,雨花区环保局,Yuhuaquhuanbaoju\n' +
    '30709,112.979,28.2597,伍家岭,Wujialing\n' +
    '30707,113.001,28.1944,火车新站,Huochexinzhan\n' +
    '30710,112.984,28.1178,天心区环保局,Tianxinquhuanbaoju\n' +
    '30704,112.891,28.1308,湖南中医药大学,Hunanzhongyiyaodaxue\n' +
    '30709,112.996,28.3586,沙坪,Shaping\n' +
    '30803,112.955556,27.861111,板塘,Bantang\n' +
    '30804,112.895689,27.857641,市监测站,Shijiancezhan\n' +
    '30804,112.918333,27.8575,江麓,Jianglu\n' +
    '30803,112.92,27.816944,岳塘,Yuetang\n' +
    '30805,112.9075,27.911667,科大,Keda\n' +
    '30803,113.021728,27.961788,昭山,Zhaoshan\n' +
    '30905,113.134722,27.824444,天台山庄,Tiantaishanzhuang\n' +
    '30906,113.095278,27.886667,株冶医院,Zhuyeyiyuan\n' +
    '30907,113.190211,27.797906,市四中,Shisizhong\n' +
    '30907,113.143333,27.838056,火车站,Huochezhan\n' +
    '30906,113.13,27.852778000000004,市监测站,Shijiancezhan\n' +
    '30907,113.251389,27.833611,大京风景区,Dajingfengjingqu\n' +
    '30906,113.1817,27.9958,云田中学,Yuntianzhongxue\n' +
    '31009,112.5328,26.9089,原169医院,Yuan169yiyuan\n' +
    '31010,112.6194,26.9258,衡阳化工总厂,Hengyanghuagongzongchang\n' +
    '31011,112.6211,26.8956,珠晖区环保局,Zhuhuiquhuanbaoju\n' +
    '31012,112.6197,26.8733,市委党校,Shiweidangxiao\n' +
    '31012,112.6006,26.8919,市监测站,Shijiancezhan\n' +
    '31009,112.5664,26.9056,真空机电公司,Zhenkongjidiangongsi\n' +
    '31110,113.0073,25.9061,马头岭,Matouling\n' +
    '31111,113.0116,25.8226,市职中,Shizhizhong\n' +
    '31111,113.0119,25.8179,兴隆步行街,Xinglongbuxingjie\n' +
    '31110,113.0383,25.8071,市审计局,Shishenjiju\n' +
    '31110,113.0348,25.7759,市环保局,Shihuanbaoju\n' +
    '31209,111.73,29.075556,百合山,Baiheshan\n' +
    '31209,111.701528,28.970389,二中,Erzhong\n' +
    '31306,112.3409,28.60185,资阳区政务中心,Ziyangquzhengwuzhongxin\n' +
    '31301,112.3458,28.5808,市环保局,Shihuanbaoju\n' +
    '31301,112.3439,28.56,特殊教育学校,Teshujiaoyuxuexiao\n' +
    '31405,111.9975,27.725,市监测站,Shijiancezhan\n' +
    '31405,112.0194,27.7314,市委党校,Shiweidangxiao\n' +
    '31405,111.9561,27.7569,涟钢,Liangang\n' +
    '31405,111.9892,27.7044,市政府,Shizhengfu\n' +
    '31503,111.5239,27.3033,水土所,Shuitusuo\n' +
    '31510,111.4733,27.2317,一中,Yizhong\n' +
    '31511,111.4908,27.2582,化工厂,Huagongchang\n' +
    '31512,111.4503,27.2537,罐头厂,Guantouchang\n' +
    '31510,111.4328,27.2272,环保局,Huanbaoju\n' +
    '31606,113.2117,29.355,金凤水库,Jinfengshuiku\n' +
    '31607,113.27231299999998,29.472746,云溪区,Yunxiqu\n' +
    '31608,113.001944,29.353889,君山区,Junshanqu\n' +
    '31606,113.150556,29.425556,城陵矶,Chenglingji\n' +
    '31606,113.170833,29.378056,开发区,Kaifaqu\n' +
    '31703,110.416667,29.3,袁家界,Yuanjiajie\n' +
    '31704,110.466944,29.129167,电业局,Dianyeju\n' +
    '31704,110.500681,29.113117,永定新区,Yongdingxinqu\n' +
    '31812,109.9333,27.5733,林科所,Linkesuo\n' +
    '31812,109.9453,27.5444,河西地税局,Hexidishuiju\n' +
    '31812,109.9792,27.5342,四医院,Siyiyuan\n' +
    '31812,109.9972,27.5578,监测楼,Jiancelou\n' +
    '31812,110.0394,27.583,市委党校,Shiweidangxiao\n' +
    '31911,111.6217,26.2081,零陵南津渡,Linglingnanjindu\n' +
    '31910,111.6156,26.4214,市环境监测站,Shihuanjingjiancezhan\n' +
    '31911,111.6236,26.2331,零陵区环保局,Linglingquhuanbaoju\n' +
    '31910,111.5992,26.4364,永州市环保局,Yongzhoushihuanbaoju\n' +
    '31910,111.5989,26.4519,冷水滩区环保局,Lengshuitanquhuanbaoju\n' +
    '32008,109.6414,28.2558,跃进水库,Yuejinshuiku\n' +
    '32008,109.7325,28.3169,州政府,Zhouzhengfu\n' +
    '32008,109.6958,28.2675,吉首市计生局,Jishoushijishengju\n' +
    '32109,106.6856,26.6029,马鞍山,Maanshan\n' +
    '32110,106.6971,26.5689,市环保站,Shihuanbaozhan\n' +
    '32103,106.6243,26.6266,鉴湖路,Jianhulu\n' +
    '32103,106.7487,26.6343,乌当区,Wudangqu\n' +
    '32102,106.6554,26.4364,花溪区,Huaxiqu\n' +
    '32102,106.6948,26.5155,小河区,Xiaohequ\n' +
    '32109,106.7105,26.6009,红边门,Hongbianmen\n' +
    '32110,106.7164,26.5697,冶金厅,Yejinting\n' +
    '32102,106.805,26.3003,桐木岭,Tongmuling\n' +
    '32213,106.917778,27.72,干田坝,Gantianba\n' +
    '32214,106.890556,27.648611,忠庄,Zhongzhuang\n' +
    '32214,106.922222,27.686944,丁字口,Dingzikou\n' +
    '32213,106.9242,27.7019,凤凰山,Fenghuangshan\n' +
    '32412,107.5228,26.2403,小围寨,Xiaoweizhai\n' +
    '32516,107.9783,26.5747,市环境监测站,Shihuanjingjiancezhan\n' +
    '32708,105.2864,27.3125,八中,Bazhong\n' +
    '32708,105.31,27.2944,师专,Shizhuan\n' +
    '32803,104.8,26.5892,窑上,Yaoshang\n' +
    '32803,104.83,26.5917,黄土坡,Huangtupo\n' +
    '32803,104.89,26.5939,水钢,Shuigang\n' +
    '32803,104.8475,26.5894,民中,Minzhong\n' +
    '32804,104.9544,26.5506,双水,Shuangshui\n' +
    '32908,104.9022,25.0925,南场坝街,Nanchangbajie\n' +
    '32908,104.8811,25.0992,南坪东大道,Nanpingdongdadao\n' +
    '33004,101.6939,26.5703,弄弄坪,Nongnongping\n' +
    '33001,101.5769,26.5928,河门口,Hemenkou\n' +
    '33004,101.7169,26.585,炳草岗,Bingcaogang\n' +
    '33001,101.7453,26.5017,仁和,Renhe\n' +
    '33103,104.7547,29.3628,大塘山,Datangshan\n' +
    '33103,104.7692,29.3411,春华路,Chunhualu\n' +
    '33208,104.7778,31.4747,富乐山,Fuleshan\n' +
    '33209,104.7536,31.4539,市人大,Shirenda\n' +
    '33209,104.6717,31.4656,高新区自来水公司,Gaoxinquzilaishuigongsi\n' +
    '33209,104.7283,31.5072,三水厂,Sanshuichang\n' +
    '33307,105.8161,30.6347,遂宁行政中心,Suiningxingzhengzhongxin\n' +
    '33308,106.056,30.8064,西山风景区,Xishanfengjingqu\n' +
    '33308,106.0789,30.8023,南充市委,Nanchongshiwei\n' +
    '33308,106.1031,30.8217,南充炼油厂,Nanchonglianyouchang\n' +
    '33309,106.1064,30.7856,高坪区监测站,Gaopingqujiancezhan\n' +
    '33307,106.0642,30.7636,嘉陵区环保局,Jialingquhuanbaoju\n' +
    '33308,106.1087,30.8388,市环境监测站,Shihuanjingjiancezhan\n' +
    '33406,107.5272,31.2797,达州职业技术学院,Dazhouzhiyejishuxueyuan\n' +
    '33406,107.525,31.215,市环境监测站,Shihuanjingjiancezhan\n' +
    '33406,107.4967,31.2108,凤凰小区,Fenghuangxiaoqu\n' +
    '33407,107.5069,31.1956,达县机关宾馆,Daxianjiguanbinguan\n' +
    '33406,107.4611,31.2058,市政中心,Shizhengzhongxin\n' +
    '33501,105.7519,30.5797,石溪浩,Shixihao\n' +
    '33501,105.68,30.6133,市监测站,Shijiancezhan\n' +
    '33503,105.5956,30.475,美宁食品公司,Meiningshipingongsi\n' +
    '33605,106.6308,30.5278,小平旧居,Xiaopingjiuju\n' +
    '33605,106.6303,30.4576,市委,Shiwei\n' +
    '33605,106.6271,30.4663,友谊中学,Youyizhongxue\n' +
    '33605,106.6388,30.4551,广电花园,Guangdianhuayuan\n' +
    '33704,106.7389,31.8711,市环保局,Shihuanbaoju\n' +
    '33704,106.7594,31.8531,巴中中学,Bazhongzhongxue\n' +
    '33704,106.7608,31.8456,职业中学,Zhiyezhongxue\n' +
    '33806,105.4306,28.9583,九狮山,Jiushishan\n' +
    '33806,105.4436,28.9026,小市上码头,Xiaoshishangmatou\n' +
    '33807,105.4322,28.8558,兰田宪桥,Lantianxianqiao\n' +
    '33806,105.4322,28.8989,市环监站,Shihuanjianzhan\n' +
    '33910,104.5969,28.8194,石马中学,Shimazhongxue\n' +
    '33910,104.6225,28.7661,市委,Shiwei\n' +
    '33910,104.6061,28.7867,宜宾四中,Yibinsizhong\n' +
    '33910,104.6417,28.7639,市政府,Shizhengfu\n' +
    '33910,104.5761,28.7158,黄金嘴,Huangjinzui\n' +
    '33910,104.6789,28.7989,沙坪中学,Shapingzhongxue\n' +
    '34005,105.0331,29.5953,市监测站,Shijiancezhan\n' +
    '34001,105.0717,29.5947,东兴区政府,Dongxingquzhengfu\n' +
    '34005,105.0653,29.5817,内江二中,Neijiangerzhong\n' +
    '34005,105.0406,29.5822,内江日报社,Neijiangribaoshe\n' +
    '34104,104.6617,30.1366,莲花山,Lianhuashan\n' +
    '34104,104.6356,30.1506,资阳中学,Ziyangzhongxue\n' +
    '34104,104.6289,30.1377,四三一厂,Sisanyichang\n' +
    '34104,104.6469,30.1142,师范校,Shifanxiao\n' +
    '34104,104.6294,30.1259,区法院,Qufayuan\n' +
    '34209,103.7627,29.5844,牛耳桥,Niuerqiao\n' +
    '34209,103.7506,29.6007,第三水厂,Disanshuichang\n' +
    '34209,103.757,29.5634,监测站,Jiancezhan\n' +
    '34306,103.8416,30.0874,气象局,Qixiangju\n' +
    '34408,102.3419,27.8094,青龙寺,Qinglongsi\n' +
    '34408,102.2714,27.8408,邛海宾馆,Qionghaibinguan\n' +
    '34408,102.2311,27.8953,长安,Changan\n' +
    '34508,103.0109,29.9834,市政府,Shizhengfu\n' +
    '34806,104.4219,31.1208,东山公园,Dongshangongyuan\n' +
    '34806,104.3883,31.1333,西小区,Xixiaoqu\n' +
    '34806,104.4053,31.1167,市检察院,Shijianchayuan\n' +
    '34806,104.3539,31.1108,耐火材料厂,Naihuocailiaochang\n' +
    '34905,105.8945,32.4535,黑石坡,Heishipo\n' +
    '34905,105.8242,32.4429,老城,Laocheng\n' +
    '34905,105.8153,32.4246,南坝,Nanba\n' +
    '34905,105.8624,32.4285,监测站,Jiancezhan\n' +
    '35012,102.743,25.0124,关上,Guanshang\n' +
    '35006,102.821,24.8885,呈贡新区,Chenggongxinqu\n' +
    '35013,102.625,24.9624,西山森林公园,Xishansenlingongyuan\n' +
    '35014,102.728,25.0836,龙泉镇,Longquanzhen\n' +
    '35014,102.722,25.0405,东风东路,Dongfengdonglu\n' +
    '35015,102.681,25.067,金鼎山,Jindingshan\n' +
    '35013,102.638,25.0359,碧鸡广场,Bijiguangchang\n' +
    '35112,100.1542,25.7054,市环境监测站,Shihuanjingjiancezhan\n' +
    '35112,100.2171,25.5811,古城,Gucheng\n' +
    '35309,103.803392,25.534613,烟厂办公区,Yanchangbangongqu\n' +
    '35302,103.541667,25.116667,环境监测站,Huanjingjiancezhan\n' +
    '35609,102.577778,24.369444,东风水库,Dongfengshuiku\n' +
    '35710,101.538,25.0492,经济开发区,Jingjikaifaqu\n' +
    '35911,103.7032,27.3392,监测站,Jiancezhan\n' +
    '35911,103.7225,27.3361,环保局,Huanbaoju\n' +
    '36008,100.0869,23.8822,环保局,Huanbaoju\n' +
    '36008,100.0782,23.8982,气象局,Qixiangju\n' +
    '36304,100.2143,26.8576,西南郊,Xinanjiao\n' +
    '36305,100.2497,26.8802,丽江古城,Lijianggucheng\n' +
    '36305,100.2203,26.8906,市中心,Shizhongxin\n' +
    '36707,107.372285,22.248333,城南新区,Chengnanxinqu\n' +
    '36707,107.3476,22.4137,江州区环保局,Jiangzhouquhuanbaoju\n' +
    '36807,109.384444,24.345833,河西水厂,Hexishuichang\n' +
    '36808,109.41,24.326389,环保监测站,Huanbaojiancezhan\n' +
    '36803,109.42,24.2,四中,Sizhong\n' +
    '36808,109.377222,24.384444,九中,Jiuzhong\n' +
    '36809,109.488278,24.389778,柳东小学,Liudongxiaoxue\n' +
    '36810,109.483889,24.315833,古亭山,Gutingshan\n' +
    '36906,109.2131,23.7208,来宾二中,Laibinerzhong\n' +
    '36906,109.2317,23.7369,来冶招待所,Laiyezhaodaisuo\n' +
    '37013,110.242,25.257,监测站,Jiancezhan\n' +
    '37014,110.308889,25.250833,龙隐小学,Longyinxiaoxue\n' +
    '37005,110.39,25.268,电子科大尧山校区,Dianzikedayaoshanxiaoqu\n' +
    '37106,111.3178,23.475,云盖小学,Yungaixiaoxue\n' +
    '37106,111.289722,23.479167,市环保,Shihuanbao\n' +
    '37107,111.2353,23.415,龙圩,Longwei\n' +
    '37108,111.26,23.4794,龙新,Longxin\n' +
    '37204,111.560833,24.4075,政协大楼,Zhengxiedalou\n' +
    '37204,111.526389,24.417778,环保小区,Huanbaoxiaoqu\n' +
    '37303,109.566944,23.106389,荷城子站,Hechengzizhan\n' +
    '37304,109.604167,23.067222,江南子站,Jiangnanzizhan\n' +
    '37303,109.60138899999998,23.094444,贵城子站,Guichengzizhan\n' +
    '37303,109.568056,23.147778,德智高中,Dezhigaozhong\n' +
    '37512,106.6103,23.9011,监测站,Jiancezhan\n' +
    '37512,106.6527,23.8844,心血站,Xinxuezhan\n' +
    '37603,108.623611,21.966667,市环保站,Shihuanbaozhan\n' +
    '37603,108.598889,21.743056,港区一小,Gangquyixiao\n' +
    '37603,108.651944,21.950556,农科所,Nongkesuo\n' +
    '37711,108.049722,24.695833,环保站,Huanbaozhan\n' +
    '37711,108.096389,24.700833,东仁乐园,Dongrenleyuan\n' +
    '37704,108.096389,24.786111,疾控中心站,Jikongzhongxinzhan\n' +
    '37803,109.153333,21.404167,海滩公园,Haitangongyuan\n' +
    '37803,109.177778,21.425278,北海工业园,Beihaigongyeyuan\n' +
    '37804,109.098056,21.466111,新市环保局,Xinshihuanbaoju\n' +
    '37803,109.225556,21.596111,牛尾岭水库,Niuweilingshuiku\n' +
    '37904,108.3411,21.6158,港沙万,Gangshawan\n' +
    '37903,108.3511,21.7631,港防城镇政府,Gangfangchengzhenzhengfu\n' +
    '37904,108.3506,21.6414,港大海花园,Gangdahaihuayuan\n' +
    '38406,109.5077,18.249083,河东子站,Hedongzizhan\n' +
    '38406,109.496315,18.2683,河西子站,Hexizizhan\n' +
    '38414,110.3239,19.6928,定安县定安环境资源监察大队,Dinganxiandinganhuanjingziyuanjianchadadui\n' +
    '38425,110.57553,19.95073,东寨港,Dongzhaigang\n' +
    '38425,110.31896,20.05955,海南大学,Hainandaxue\n' +
    '38426,110.28317,20.0053,秀英海南医院,Xiuyinghainanyiyuan\n' +
    '38427,110.33755,19.99693,海南师范大学,Hainanshifandaxue\n' +
    '38427,110.33025,20.03565,龙华路环保局宿舍,Longhualuhuanbaojusushe\n' +
    '38426,110.21858,19.92636,石山,Shishan\n' +
    '38406,109.71186000000002,18.290147,海棠湾站,Haitangwanzhan\n' +
    '38406,109.49363999999998,18.22053,鹿回头站,Luhuitouzhan\n' +
    '38406,109.620378,18.224494,亚龙湾站,Yalongwanzhan\n' +
    '38414,110.348611,19.68225,定安县自来水公司站,Dinganxianzilaishuigongsizhan\n'


// 使用PapaParse将CSV转换为GeoJSON
function csvToGeoJSON(csv) {
    const geojson = {
        type: 'FeatureCollection',
        features: []
    };

    Papa.parse(csv, {
        header: true,
        skipEmptyLines: true,
        complete: function (results) {
            results.data.forEach(row => {
                const feature = {
                    type: 'Feature',
                    geometry: {
                        type: 'Point',
                        coordinates: [parseFloat(row.longitude), parseFloat(row.latitude)]
                    },
                    properties: row
                };
                geojson.features.push(feature);
            });
        }
    });

    return geojson;
}

function addStationsLayer() {
    // Convert your CSV data to GeoJSON
    const geojsonData = csvToGeoJSON(station_data);

    // Generate random pm25 values and add them to geojsonData
    geojsonData.features.forEach(feature => {
        // Generate a random pm25 value between 0 and 600
        feature.properties.pm25 = getRandomInt(0, 600)
    });

    console.log(geojsonData)

    // Add data source
    map.addSource('stations', {
        type: 'geojson',
        data: geojsonData
    });



    // Add data layer with dynamic circle colors based on PM2.5 values
    map.addLayer({
        id: '1085-stations-1cyyg4',
        type: 'circle',
        source: 'stations',
        paint: {
            'circle-radius': 5,
            'circle-color': [
                'case',
                ['<', ['get', 'pm25'], 12], 'rgb(206, 199, 255)',
                ['<', ['get', 'pm25'], 36], 'rgb(164, 151, 253)',
                ['<', ['get', 'pm25'], 56], 'rgb(143, 129, 238)',
                ['<', ['get', 'pm25'], 151], 'rgb(120, 103, 235)',
                ['<', ['get', 'pm25'], 251], 'rgb(106, 92, 216)',
                'rgb(88, 77, 174)'
            ],
            'circle-stroke-color': 'white', // 设置边缘为白色
            'circle-stroke-width': 1 // 设置边缘宽度为1像素
        },
    });

    // map.addLayer({
    //     id: '1085-stations-1cyyg4',
    //     type: 'circle',
    //     source: 'stations',
    //     paint: {
    //         'circle-radius': 4,
    //         'circle-color': '#64b4b9'
    //     },
    // });


}

function generateRandomData() {
    return {
        pm25: getRandomInt(0, 500),          // PM2.5的范围: 0-500 μg/m³
        pm10: getRandomInt(0, 1000),         // PM10的范围: 0-1000 μg/m³
        no2: getRandomInt(0, 200),           // NO2的范围: 0-200 ppb
        co: getRandomInt(0, 10),             // CO的范围: 0-10 ppm
        o3: getRandomInt(0, 500),            // O3的范围: 0-500 ppb
        so2: getRandomInt(0, 500),           // SO2的范围: 0-500 ppb
        rainfall: getRandomFloat(0, 50),     // 降雨量的范围: 0-50 mm
        temperature: getRandomInt(-30, 50),  // 温度的范围: -30-50 °C
        pressure: getRandomInt(900, 1100),   // 气压的范围: 900-1100 hPa
        humidity: getRandomInt(0, 100),      // 湿度的范围: 0-100 %
        windSpeed: getRandomFloat(0, 30),    // 风速的范围: 0-30 m/s
        windDirection: getRandomInt(0, 360), // 风向的范围: 0-360°
        weather: getRandomWeather()          // 随机天气情况
    };
}

function getRandomInt(min, max) {
    return Math.floor(Math.random() * (max - min + 1)) + min;
}

function getRandomFloat(min, max) {
    return (Math.random() * (max - min) + min).toFixed(2);
}

function getRandomWeather() {
    const weathers = ["晴", "多云", "阴", "雨", "雪", "雷", "雾"];
    return weathers[getRandomInt(0, weathers.length - 1)];
}

// 测试
function isWithinBounds(lngLat) {
    const minLng = 73.683851;
    const maxLng = 135.383069;
    const minLat = 18.424216;
    const maxLat = 53.714166;

    return lngLat.lng >= minLng && lngLat.lng <= maxLng && lngLat.lat >= minLat && lngLat.lat <= maxLat;
}

function fetchDataForLocation(lngLat, callback) {
    // 这里我们使用generateRandomData来模拟真实的数据查询
    var data = generateRandomData();
    callback(data);
}

function getPollutionLevel(pm25) {
    if (pm25 <= 50) {
        return {level: '优', color: '#00FF00'};
    } else if (pm25 <= 100) {
        return {level: '良', color: '#FFFF00'};
    } else if (pm25 <= 150) {
        return {level: '轻度污染', color: '#FFA500'};
    } else if (pm25 <= 200) {
        return {level: '中度污染', color: '#FF4500'};
    } else if (pm25 <= 300) {
        return {level: '重度污染', color: '#FF0000'};
    } else {
        return {level: '严重污染', color: '#8B0000'};
    }
}

function generatePopupContent(data) {
    // 然后在弹出框的HTML内容中加入该色柱和文本：
    const pollution = getPollutionLevel(data.pm25);
    const now = new Date();
    const hours = now.getHours() > 12 ? now.getHours() - 12 : now.getHours();
    const minutes = now.getMinutes().toString().padStart(2, '0');  // 保证分钟总是两位数
    const amPm = now.getHours() >= 12 ? 'PM' : 'AM';
    const formattedTime = `更新于 ${hours}:${minutes} ${amPm}`;
    return `
        <div style="display: grid; grid-template-columns: auto 14px auto;">
            <div style="grid-column: 1 / span 3; display: flex; align-items: center; justify-content: flex-start; margin: 0 0 8px 0">
                <div style="width: 6px; height: 12px; background-color: ${pollution.color};"></div>
                <div style="padding-left: 8px">${pollution.level}</div>
            </div>
            ${generateIndicatorWithColorBox('PM2.5', data.pm25)}
            ${generateIndicatorWithColorBox('PM10', data.pm10)}
            ${generateIndicatorWithColorBox('NO2', data.no2)}
            ${generateIndicatorWithColorBox('CO', data.co)}
            ${generateIndicatorWithColorBox('O3', data.o3)}
            ${generateIndicatorWithColorBox('SO2', data.so2)}
            <div> Rainfall</div> <div><i style="margin: 5px 5px;" class="fas fa-cloud-rain"></i></div> <div style="padding-left: 12px">${data.rainfall} mm</div>
            <div> Temperature</div> <div><i style="margin: 5px 5px;" class="fas fa-thermometer"></i></div> <div style="padding-left: 12px">${data.temperature} °C</div>
            <div> Pressure</div> <div><i style="margin: 5px 5px;" class="fas fa-tachometer-alt"></i></div> <div style="padding-left: 12px">${data.pressure} hPa</div>
            <div> Humidity</div> <div><i style="margin: 5px 5px;" class="fas fa-water"></i></div> <div style="padding-left: 12px">${data.humidity} %</div>
            <div> Wind Speed</div> <div><i style="margin: 5px 5px;" class="fas fa-wind"></i></div> <div style="padding-left: 12px">${data.windSpeed} m/s</div>
            <div> Wind Direction</div> <div><i style="margin: 5px 5px;" class="fas fa-location-arrow"></i></div> <div style="padding-left: 12px">${data.windDirection}°</div>
            <div> Weather</div> <div><i style="margin: 5px 5px;" class="fas fa-smog"></i></div> <div style="padding-left: 12px">${data.weather}</div>
            <div style="grid-column: 1 / span 2; color: steelblue; padding-top: 8px">${formattedTime}</div>
        </div>
    `;
}

function generateIndicatorWithColorBox(indicatorName, value) {
    const color = getColorForValue(value);
    return `
        <div>${indicatorName}</div>
        <div style="width: 12px; height: 12px; background-color: ${color}; margin: 5px 5px;"></div>
        <div style="padding-left: 12px">${value}</div>
    `;
}


function getColorForValue(value) {
    if (value <= 50) return '#00FF00';       // Green
    if (value <= 100) return '#FFFF00';      // Yellow
    if (value <= 150) return '#FFA500';      // Orange
    if (value <= 200) return '#FF4500';      // Light Red
    if (value <= 300) return '#FF0000';      // Red
    return '#8B0000';                        // Dark Red
}